.svn/pristine/61/61014561c2ad38466ce256ed2aa6190d33bd2da9.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:fram="http://framework.facade.common.transcore.pinganfu.com/">
	<soapenv:Header />
	<soapenv:Body>
		<fram:transactionCheckIn>
			<arg0>
				<bankCardInfo>
 				</bankCardInfo>
				<busiChannel>W</busiChannel>
				<businessCode>20</businessCode>
				<ccy>CNY</ccy>
				<customerId>2000010000000002</customerId> <!--    类型户 -->
				<dcFlag>D</dcFlag>
				<inBankCardInfo>

				</inBankCardInfo>
				<orderNo>${orderNo}</orderNo>
				<outBankCardInfo>

				</outBankCardInfo>
				<productCode>100010020000</productCode>
				<registerFlag>0</registerFlag>
				<subLedgerDetails>

				</subLedgerDetails>
				<toCustomerId>2000010000000004</toCustomerId> <!-- 00  和    类型户 -->
				<transAmount>1000000</transAmount>
				<transTotalAmount>1000000</transTotalAmount>
				<transType>12</transType>
			</arg0>
		</fram:transactionCheckIn>
	</soapenv:Body>
</soapenv:Envelope>